jMeter_config.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group (REST)">
        <intProp name="ThreadGroup.num_threads">150</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10000</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies">
            <elementProp name="jwt" elementType="Cookie" testname="jwt">
              <stringProp name="Cookie.value">eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3MjYxNDY0ODYsIlVzZXJJRCI6MSwiU2FtbFN1YmplY3RJRCI6bnVsbH0.bUmfezOGruqylJYz6H_yA_hbdbV4CahsEbmtnOFbIs4rvG0DrvmVKgiu-qMGRa76u5KsP8IZkDi4_z8pdrs3-GtZF5EpdXYI-E4k5tMWp6RLix7E4eSnJBWn4Mt0MQg2ZmmrLeMRUF8gHvs7atLSVb78UfLEqGx__G30Os4Zu5WEsSDMA9OOiFdsQOqfxVvOT2-XoGispDjkBkSJUIort-HsdQhi9z5P8_RkwhN6lIC4yB1noRBtGjqWxMMawL5ZNAHxohLequi_kJMXf31LGcZ23CCSEmfhgDTC428IBAfgZRhnbmIhvEnffaFEM5bjo_hsYuYVQX7X9Kp-RhZtFw</stringProp>
              <stringProp name="Cookie.domain">localhost</stringProp>
              <boolProp name="Cookie.secure">false</boolProp>
              <longProp name="Cookie.expires">0</longProp>
              <boolProp name="Cookie.path_specified">true</boolProp>
              <boolProp name="Cookie.domain_specified">true</boolProp>
            </elementProp>
          </collectionProp>
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Simple Controller" enabled="true"/>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8081</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">api/courses/public</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8081</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">api/users/settings/greeting</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;value&quot;: &quot;Moin&quot;&#xd;
}&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">8081</stringProp>
            <stringProp name="HTTPSampler.protocol">http</stringProp>
            <stringProp name="HTTPSampler.path">api/users/courses/pin</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{&#xd;
	&quot;courseID&quot;: 1&#xd;
}&#xd;
</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/home/cb/Documents/summary_150_10_10000.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group (gRPC)" enabled="false">
        <intProp name="ThreadGroup.num_threads">150</intProp>
        <intProp name="ThreadGroup.ramp_time">10</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10000</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Simple Controller" enabled="true"/>
        <hashTree>
          <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request" enabled="true">
            <stringProp name="GRPCSampler.protoFolder">/home/cb/Documents</stringProp>
            <stringProp name="GRPCSampler.metadata">{&quot;grpcgateway-cookie&quot;:&quot;jwt=eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3MjYyNjMxMjAsIlVzZXJJRCI6MSwiU2FtbFN1YmplY3RJRCI6bnVsbH0.ddt-JzOGRc4o3VMND_T51D9HDUHfQKXKdln5dknnYWkMkMy1LWqwozKwQ9U1kI3O8f3W-CDrexzfTF0qfdm9TbFdPDJwqNHMLgjTRCWP6hGvuPcgIw1Ea0_e96d8lxxq0npso8PayOhqD84lWUuZ-yH_OcFqm_7s3yJyTdLHoU8kNlzSAh-EaDw2toxu5GOTiNA44yAu5ZdQJVZBgf9YnbJKBuP3n2EqAjP2-Q3lf-CsvrXXHY7bdjN1MsuibGpdtQ7U27yuRKDzZr8KLjwkANcgcctulBOIYuYUU2G-tvriBygU0q-hJWrO2Z-OjpH-z8vGyT4vOYdThwSeiJjw9g&quot;}</stringProp>
            <stringProp name="GRPCSampler.host">localhost</stringProp>
            <stringProp name="GRPCSampler.port">8081</stringProp>
            <stringProp name="GRPCSampler.fullMethod">protobuf.API/getPublicCourses</stringProp>
            <stringProp name="GRPCSampler.deadline">1000</stringProp>
            <boolProp name="GRPCSampler.tls">false</boolProp>
            <boolProp name="GRPCSampler.tlsDisableVerification">true</boolProp>
            <stringProp name="GRPCSampler.channelAwaitTermination">1000</stringProp>
            <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
            <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
            <stringProp name="GRPCSampler.requestJson">{
    &quot;term&quot;: &quot;S&quot;,
    &quot;year&quot;: 2024
}</stringProp>
          </vn.zalopay.benchmark.GRPCSampler>
          <hashTree/>
          <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request" enabled="true">
            <stringProp name="GRPCSampler.protoFolder">/home/cb/Documents</stringProp>
            <stringProp name="GRPCSampler.metadata">{&quot;grpcgateway-cookie&quot;:&quot;jwt=eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3MjYyNjMxMjAsIlVzZXJJRCI6MSwiU2FtbFN1YmplY3RJRCI6bnVsbH0.ddt-JzOGRc4o3VMND_T51D9HDUHfQKXKdln5dknnYWkMkMy1LWqwozKwQ9U1kI3O8f3W-CDrexzfTF0qfdm9TbFdPDJwqNHMLgjTRCWP6hGvuPcgIw1Ea0_e96d8lxxq0npso8PayOhqD84lWUuZ-yH_OcFqm_7s3yJyTdLHoU8kNlzSAh-EaDw2toxu5GOTiNA44yAu5ZdQJVZBgf9YnbJKBuP3n2EqAjP2-Q3lf-CsvrXXHY7bdjN1MsuibGpdtQ7U27yuRKDzZr8KLjwkANcgcctulBOIYuYUU2G-tvriBygU0q-hJWrO2Z-OjpH-z8vGyT4vOYdThwSeiJjw9g&quot;}</stringProp>
            <stringProp name="GRPCSampler.host">localhost</stringProp>
            <stringProp name="GRPCSampler.port">8081</stringProp>
            <stringProp name="GRPCSampler.fullMethod">protobuf.API/patchUserSettings</stringProp>
            <stringProp name="GRPCSampler.deadline">1000</stringProp>
            <boolProp name="GRPCSampler.tls">false</boolProp>
            <boolProp name="GRPCSampler.tlsDisableVerification">true</boolProp>
            <stringProp name="GRPCSampler.channelAwaitTermination">1000</stringProp>
            <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
            <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
            <stringProp name="GRPCSampler.requestJson">{
	&quot;userSettings&quot;:[
		{
			&quot;type&quot;: &quot;GREETING&quot;,
			&quot;value&quot;: &quot;Moin&quot;
		},
		        {
            &quot;type&quot;: &quot;CUSTOM_PLAYBACK_SPEEDS&quot;,
            &quot;value&quot;: &quot;[{\&quot;speed\&quot;:1.0,\&quot;enabled\&quot;:true},{\&quot;speed\&quot;:0.75,\&quot;enabled\&quot;:true},{\&quot;speed\&quot;:0.5,\&quot;enabled\&quot;:true},{\&quot;speed\&quot;:0.25,\&quot;enabled\&quot;:true},{\&quot;speed\&quot;:1.25,\&quot;enabled\&quot;:true}]&quot;
        }
	]
}</stringProp>
          </vn.zalopay.benchmark.GRPCSampler>
          <hashTree/>
          <vn.zalopay.benchmark.GRPCSampler guiclass="vn.zalopay.benchmark.GRPCSamplerGui" testclass="vn.zalopay.benchmark.GRPCSampler" testname="GRPC Request" enabled="true">
            <stringProp name="GRPCSampler.protoFolder">/home/cb/Documents</stringProp>
            <stringProp name="GRPCSampler.metadata">{&quot;grpcgateway-cookie&quot;:&quot;jwt=eyJhbGciOiJSUzI1NiIsInR5cCI6IkpXVCJ9.eyJleHAiOjE3MjYyNjMxMjAsIlVzZXJJRCI6MSwiU2FtbFN1YmplY3RJRCI6bnVsbH0.ddt-JzOGRc4o3VMND_T51D9HDUHfQKXKdln5dknnYWkMkMy1LWqwozKwQ9U1kI3O8f3W-CDrexzfTF0qfdm9TbFdPDJwqNHMLgjTRCWP6hGvuPcgIw1Ea0_e96d8lxxq0npso8PayOhqD84lWUuZ-yH_OcFqm_7s3yJyTdLHoU8kNlzSAh-EaDw2toxu5GOTiNA44yAu5ZdQJVZBgf9YnbJKBuP3n2EqAjP2-Q3lf-CsvrXXHY7bdjN1MsuibGpdtQ7U27yuRKDzZr8KLjwkANcgcctulBOIYuYUU2G-tvriBygU0q-hJWrO2Z-OjpH-z8vGyT4vOYdThwSeiJjw9g&quot;}</stringProp>
            <stringProp name="GRPCSampler.host">localhost</stringProp>
            <stringProp name="GRPCSampler.port">8081</stringProp>
            <stringProp name="GRPCSampler.fullMethod">protobuf.API/postUserPinned</stringProp>
            <stringProp name="GRPCSampler.deadline">1000</stringProp>
            <boolProp name="GRPCSampler.tls">false</boolProp>
            <boolProp name="GRPCSampler.tlsDisableVerification">true</boolProp>
            <stringProp name="GRPCSampler.channelAwaitTermination">1000</stringProp>
            <stringProp name="GRPCSampler.maxInboundMessageSize">4194304</stringProp>
            <stringProp name="GRPCSampler.maxInboundMetadataSize">8192</stringProp>
            <stringProp name="GRPCSampler.requestJson">{
	&quot;courseID&quot;:1
}</stringProp>
          </vn.zalopay.benchmark.GRPCSampler>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/home/cb/Documents/jmeter.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>